bookers5/app/controllers/books_controller.rb

INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Ctoti2"], ["body", "ctoti2"], ["user_id", 2], ["created_at", "2020-05-19 13:14:47.572042"], ["updated_at", "2020-05-19 13:14:47.572042"]]
SELECT "books".* FROM "books"
---
  def create
  	@book = Book.new(book_params) #Bookモデルのテーブルを使用しているのでbookコントローラで保存する。
    @book.user_id = current_user.id

    # @book = current_user.books.new(book_params)
    # ==============
  	if @book.save #入力されたデータをdbに保存する。
  		redirect_to @book, notice: "successfully created book!"#保存された場合の移動先を指定。
  	else
  		@books = Book.all

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 1]]
---
  def destroy
  	@book = Book.find(params[:id])
  	@book.delete

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
  def baria_book
    book = Book.find(params[:id])