bookers5/app/views/search/search.html.erb

					<% end %>
					<td>コメント数 : <%= book.book_comments.count %></td>
---
SELECT "books".* FROM "books" WHERE (title LIKE '%%')
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 2]]