bookers5/app/views/books/index.html.erb

SELECT "books".* FROM "books"
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 6]]
---
					<% end %>
					<td>コメント数 : <%= book.book_comments.count %></td>