bookers5/app/views/books/show.html.erb

					<i class="fa fa-heart" aria-hidden="true" style="color: red;"></i>
					<%= @book.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]

					<i class="fa fa-heart-o" aria-hidden="true"></i>
					<%= @book.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 6]]

				<% end %>
				<td>コメント数 : <%= @book.book_comments.count %></td>
---
SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 6]]
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 6]]

		<table class="table">
			<% @book.book_comments.each do |c| %>
---
SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 6]]