bookers5/app/models/user.rb

SELECT  1 AS one FROM "users" INNER JOIN "relationships" ON "users"."id" = "relationships"."follow_id" WHERE "relationships"."user_id" = ? AND "users"."id" = ? LIMIT ?  [["user_id", 2], ["id", 3], ["LIMIT", 1]]
---
  def following?(user)
    following_user.include?(user)