bookers2-debug/app/controllers/users_controller.rb

  def update
  	@user = User.find(params[:id])
  	if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "introduction" = ?, "profile_image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "toti3"], ["introduction", ""], ["profile_image_id", nil], ["updated_at", "2020-05-18 12:10:57.101021"], ["id", 3]]